export const projects = [
  {
    id: 1,
    title: {
      ru: "Интернет-магазин товаров для животных",
      en: "Pet Supplies E-Commerce Store"
    },
    description: {
      ru: "Разработал полнофункциональный сайт с каталогом товаров, корзиной и формой заказа. Реализовал серверную логику и работу с базой данных. Проект выполнен в одиночку, от идеи до деплоя."    },
    technologies: ["PHP", "HTML", "CSS", "SQL"],
    demo: "#"
  },
  {
    id: 2,
    title: {
      ru: "Программа голосового управления ПК",
    },
    description: {
      ru: "Создаю приложение для управления системой голосовыми командами. Изучаю работу с API распознавания речи и асинхронным программированием. Проект в активной разработке."    },
    technologies: ["Python", "Speech Recognition", "Async"],
    demo: "#"
  },
  {
    id: 3,
    title: {
      ru: "Мобильное приложение для ВУЗа с элементами ИИ",
    },
    description: {
      ru: "Приложение с новостями и полезной информацией для абитуриентов. Интегрировал ИИ для ответов на вопросы абитуриентов. Разрабатывалась в команде.",
    },
    technologies: ["Flutter", "Dart", "AI"],
    demo: "#"
  },
  {
    id: 4,
    title: {
      ru: "Телеграм-боты на Python",
    },
    description: {
      ru: "Создал несколько чат-ботов для автоматизации задач и взаимодействия с пользователями. Отработал навыки работы с API и обработки пользовательских запросов.",
    },
    technologies: ["Python", "aiogram", "Telegram API"],
    demo: "#"
  },
  {
    id: 5,
    title: {
      ru: "Лендинги и одностраничные сайты",
    },
    description: {
      ru: "Разрабатывал адаптивные одностраничные сайты с анимациями и интерактивными элементами.",
    },
    technologies: ["HTML", "CSS", "JavaScript"],
    demo: "#"
  },
  {
    id: 6,
    title: {
      ru: "Приложение для изучения удмуртского языка",
    },
    description: {
      ru: "Приложение для изучения удмуртского языка в формате игр. Разработано на Flutter в рамках хакатона от Т2. Включает уроки, упражнения в виде игр и систему прогресса.",
    },
    technologies: ["Flutter", "Dart"],
  }
];
